#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/frango-finastra/review-ex/runs/run-Am5MkEhorFgTd6F5

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.k8s will be created
  + resource "azurerm_resource_group" "k8s" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "newatcherrg"
    }

  # module.networks.azurerm_subnet.this["agic"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.32.224.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "agicsn01"
      + resource_group_name                            = "newatcherrg"
      + virtual_network_name                           = "northeurope-vnet01"
    }

  # module.networks.azurerm_subnet.this["lb"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.32.224.128/25",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "lbsn01"
      + resource_group_name                            = "newatcherrg"
      + virtual_network_name                           = "northeurope-vnet01"
    }

  # module.networks.azurerm_subnet.this["node_pool_1"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "172.16.0.0/19",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "node_pool_1sn01"
      + resource_group_name                            = "newatcherrg"
      + virtual_network_name                           = "northeurope-vnet01"
    }

  # module.networks.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space         = [
          + "10.32.224.0/25",
          + "10.32.224.128/25",
          + "172.16.0.0/19",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northeurope"
      + name                  = "northeurope-vnet01"
      + resource_group_name   = "newatcherrg"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @AndreasFrangopoulos, Action: `pull_request`*